# ETL the data from 3NF tables to Facts & Dimension Tables
**

In [1]:
# Create your database

In [2]:
# Create a connection with your database

### 3NF - Entity Relationship Diagram

<img src="./pagila-3nf.png" width="50%"/>

### Star Schema - Entity Relationship Diagram

<img src="./pagila-star.png" width="50%"/>

# Creating the tables

In [8]:
%%sql
CREATE TABLE dimDate
(
    date_key serial primary key,
    date date,
    year smallint,
    quarter smallint,
    month smallint,
    day smallint,
    week smallint,
    is_weekend bool
);
CREATE TABLE dimCustomer
(
  customer_key SERIAL PRIMARY KEY,
  customer_id  smallint NOT NULL,
  first_name   varchar(45) NOT NULL,
  last_name    varchar(45) NOT NULL,
  email        varchar(50),
  address      varchar(50) NOT NULL,
  address2     varchar(50),
  district     varchar(20) NOT NULL,
  city         varchar(50) NOT NULL,
  country      varchar(50) NOT NULL,
  postal_code  varchar(10),
  phone        varchar(20) NOT NULL,
  active       smallint NOT NULL,
  create_date  timestamp NOT NULL,
  start_date   date NOT NULL,
  end_date     date NOT NULL
);

CREATE TABLE dimMovie
(
  movie_key          SERIAL PRIMARY KEY,
  film_id            smallint NOT NULL,
  title              varchar(255) NOT NULL,
  description        text,
  release_year       year,
  language           varchar(20) NOT NULL,
  original_language  varchar(20),
  rental_duration    smallint NOT NULL,
  length             smallint NOT NULL,
  rating             varchar(5) NOT NULL,
  special_features   varchar(60) NOT NULL
);
CREATE TABLE dimStore
(
  store_key           SERIAL PRIMARY KEY,
  store_id            smallint NOT NULL,
  address             varchar(50) NOT NULL,
  address2            varchar(50),
  district            varchar(20) NOT NULL,
  city                varchar(50) NOT NULL,
  country             varchar(50) NOT NULL,
  postal_code         varchar(10),
  manager_first_name  varchar(45) NOT NULL,
  manager_last_name   varchar(45) NOT NULL,
  start_date          date NOT NULL,
  end_date            date NOT NULL
);
CREATE TABLE factSales
(
    sales serial primary key,
    date_id integer REFERENCES dimDate(date_key),
    customer_id integer REFERENCES dimCustomer(customer_key),
    movie_id integer REFERENCES dimMovie(movie_key),
    store_id integer REFERENCES dimStore(store_key),
    sales_amount numeric
);

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.
Done.
Done.
Done.
Done.

[]

# In this section, I'll populate the tables in the Star schema. I will `extract` data from the normalized database, `transform` it, and `load` it into the new tables.

In [13]:
%%sql
INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(payment_date)                                           AS date,
       EXTRACT(year FROM payment_date)                              AS year,
       EXTRACT(quarter FROM payment_date)                           AS quarter,
       EXTRACT(month FROM payment_date)                             AS month,
       EXTRACT(day FROM payment_date)                               AS day,
       EXTRACT(week FROM payment_date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) THEN true ELSE false END AS is_weekend
FROM payment;

 * postgresql://student:***@127.0.0.1:5432/pagila
40 rows affected.

[]

In [20]:
%%sql
INSERT INTO dimCustomer (customer_id, first_name, last_name, email, address, 
                         address2, district, city, country, postal_code, phone, active, 
                         create_date, start_date, end_date)
SELECT 
        c.customer_id,
        c.first_name,
        c.last_name,
        c.email,
        a.address,
        a.address2,
        a.district,
        ci.city,
        co.country,
        a.postal_code,
        a.phone,
        c.active,
        c.create_date,
        now()         AS start_date,
        now()         AS end_date
FROM customer c
JOIN address a  ON (c.address_id = a.address_id)
JOIN city ci    ON (a.city_id = ci.city_id)
JOIN country co ON (ci.country_id = co.country_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
599 rows affected.

[]

In [21]:
%%sql
INSERT INTO dimMovie (film_id, title, description, release_year, language, original_language
                     , rental_duration, length, rating, special_features)
SELECT 
        f.film_id,
        f.title,
        f.description,
        f.release_year,
        l.name as language,
        orig_lang.name AS original_language,
        f.rental_duration,
        f.length,
        f.rating,
        f.special_features
        
FROM film f
JOIN language l              ON (f.language_id=l.language_id)
LEFT JOIN language orig_lang ON (f.original_language_id = orig_lang.language_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
1000 rows affected.

[]

In [29]:
%%sql
INSERT INTO dimStore (store_id, address, address2, district, city, country
                     , postal_code, manager_first_name, manager_last_name, start_date, end_date)
SELECT 
        store.store_id,
        a.address,
        a.address2,
        a.district,
        ci.city,
        co.country,
        a.postal_code,
        staff.first_name as manager_first_name,
        staff.last_name as manager_last_name,
        now()         AS start_date,
        now()         AS end_date
FROM store store
JOIN address a  ON (store.address_id = a.address_id)
JOIN city ci    ON (a.city_id = ci.city_id)
JOIN country co ON (ci.country_id = co.country_id)
JOIN staff staff ON (store.manager_staff_id = staff.staff_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
2 rows affected.

[]

In [62]:
%%sql
INSERT INTO factSales (date_id, customer_id, movie_id, store_id, sales_amount)
SELECT 
        DISTINCT(TO_CHAR(pay.payment_date :: DATE, 'yyyyMMDD')::integer) as date_id,
        pay.customer_id as customer_id,
        inv.film_id as movie_id,
        inv.store_id as store_id,
        pay.amount as sales_amount
FROM payment pay
JOIN rental rental on (rental.rental_id = pay.rental_id)
JOIN inventory inv on (inv.inventory_id = rental.inventory_id)

 * postgresql://student:***@127.0.0.1:5432/pagila
16049 rows affected.

[]